{
  "posts": [
    {
      "id": 1,
      "slug": "journey-into-ai-and-research",
      "title": "My Journey into AI and Research",
      "excerpt": "From curiosity about algorithms to hands-on projects, here’s how I started my journey in AI, research, and optimization methods.",
      "content": "# My Journey into AI and Research\n\nEveryone’s entry into AI is different. For me, it started with curiosity about how machines could think, learn, and adapt. Over time, I explored different fields  from web development to optimization problems  and eventually found myself diving deeper into research.\n\n## First Steps\n- Playing around with basic Python ML libraries like scikit-learn.\n- Building small projects like digit recognition and text classification.\n- Participating in hackathons to test my problem-solving.\n\n## Moving Towards Research\nMy interest expanded into optimization techniques, domain adaptation, and trustworthiness of AI systems. This meant going beyond coding  I had to study theory, proofs, and experiment design.\n\n## Challenges Faced\n- Balancing coursework with research.\n- Understanding complex math behind optimization.\n- Debugging large models (often late at night 😅).\n\n## Why I Love It\nResearch gives me a sense of contribution  creating something that adds to knowledge, not just applying what already exists.\n\n## Looking Ahead\nI want to explore how AI can be made **reliable and interpretable**, especially in critical areas like climate prediction, healthcare, and autonomous systems.\n\n---\nThis journey is ongoing, but every project and every paper teaches me something new.",
      "publishDate": "2025-09-08T10:00:00Z",
      "categories": ["Artificial Intelligence", "Research"],
      "tags": ["AI", "Research", "Optimization", "Machine Learning"],
      "views": 0,
      "featured": true,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "9 min read"
    },
    {
      "id": 2,
      "slug": "hackathon-lessons-learned",
      "title": "Lessons Learned from Hackathons",
      "excerpt": "Hackathons aren’t just about coding. They teach teamwork, time management, and how to turn ideas into reality under pressure.",
      "content": "# Lessons Learned from Hackathons\n\nI’ve been part of multiple hackathons  from ISRO’s challenges to student innovation fests. Each one left me with lessons far beyond coding.\n\n## Key Takeaways\n\n### 1. Ideas Matter More than Perfect Code\nJudges want to see **impactful solutions**, not just polished UIs.\n\n### 2. Teamwork is Everything\nGood collaboration can make or break a project. Learning to divide tasks effectively is a skill in itself.\n\n### 3. Time Management\nYou don’t have time to reinvent the wheel. Using existing tools, libraries, and APIs is crucial.\n\n### 4. Pitching is as Important as Building\nYou can build a great project, but if you can’t explain it well, it won’t shine.\n\n## Personal Growth\nHackathons pushed me to step outside my comfort zone, work with new people, and handle pressure in creative ways.\n\n## Why You Should Try One\nIf you’re a student or early in your career, I highly recommend hackathons. They’re crash courses in innovation, collaboration, and communication.\n\n---\nI see hackathons as mini-research labs where you can test crazy ideas fast. Every event has shaped me as both a coder and a researcher.",
      "publishDate": "2025-09-07T17:00:00Z",
      "categories": ["Technology", "Student Life"],
      "tags": ["Hackathon", "Innovation", "Teamwork", "Experience"],
      "views": 0,
      "featured": true,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "7 min read"
    },
    {
      "id": 3,
      "slug": "balancing-research-and-life",
      "title": "Balancing Research and Life as a Student",
      "excerpt": "Research can be exciting, but it’s also demanding. Here’s how I try to balance academics, research, and personal growth without burning out.",
      "content": "# Balancing Research and Life as a Student\n\nResearch is rewarding, but it can also be overwhelming. Between coursework, deadlines, and experiments, I’ve had my share of sleepless nights. Over time, I realized balance is not a luxury  it’s essential.\n\n## What Works for Me\n\n### 1. Structured Time\nBlocking time for deep work and relaxation helps me stay consistent.\n\n### 2. Mixing Projects\nWorking on both coding-heavy projects and conceptual ones keeps things fresh.\n\n### 3. Community Matters\nBeing part of student councils, discussions, and clubs gives me a support system.\n\n### 4. Small Wins\nEvery solved bug, every figure generated for a paper feels like progress  and that motivates me.\n\n## Lessons Learned\n- Burnout is real, don’t ignore it.\n- Saying “no” is sometimes necessary.\n- Celebrate milestones, even small ones.\n\n## Final Thought\nBalancing life and research is not about being perfect every day. It’s about being consistent, knowing when to push, and when to rest.",
      "publishDate": "2025-09-06T12:30:00Z",
      "categories": ["Personal Growth", "Research"],
      "tags": ["Balance", "Research Life", "Student Journey", "Motivation"],
      "views": 0,
      "featured": true,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "6 min read"
    },
    {
      "id": 4,
      "slug": "coding-at-3am",
      "title": "Why All My Best Code Happens at 3 AM",
      "excerpt": "There’s something magical (and slightly unhealthy) about late-night coding. Let’s talk about caffeine, bugs, and the silence of the night.",
      "content": "# Why All My Best Code Happens at 3 AM\n\nIf you’ve ever seen me online at 3 AM, chances are I’m not watching cat videos (okay, maybe sometimes). I’m debugging something that refuses to work during the day but magically fixes itself at night.\n\n## Why Late Nights Work for Me\n- **Silence = Focus**: No notifications, no meetings, no “are you free?” pings.\n- **Brain Mode Switch**: At night, my brain somehow accepts chaos and finds solutions.\n- **Caffeine Kicks In**: That evening coffee finally decides to show results.\n\n## Things I’ve Learned\n- Bugs disappear at 3 AM… but so does your sanity.\n- Code written at night looks like genius until morning you reads it.\n- Sleep deprivation is not a long-term productivity hack (trust me).\n\n## Final Thought\nIf you ever feel stuck, try coding at odd hours. Just don’t blame me if you end up arguing with semicolons at 4 AM.",
      "publishDate": "2025-09-08T20:00:00Z",
      "categories": ["Tech Life", "Personal"],
      "tags": ["Coding", "Student Life", "Humor", "Night Owl"],
      "views": 0,
      "featured": false,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "5 min read"
    },
    {
      "id": 5,
      "slug": "research-vs-reality",
      "title": "Research vs Reality: Expectations vs What Actually Happens",
      "excerpt": "Research looks glamorous from the outside. Spoiler: It’s mostly errors, waiting for code to run, and rethinking life choices.",
      "content": "# Research vs Reality: Expectations vs What Actually Happens\n\nWhen I first stepped into research, I imagined myself discovering groundbreaking algorithms and changing the world. Reality? Mostly fighting with LaTeX and GPU memory errors.\n\n## Expectations\n- Coming up with revolutionary ideas.\n- Publishing in top journals.\n- Collaborating with genius minds.\n- Inspiring quotes about “pushing boundaries of knowledge.”\n\n## Reality\n- *‘CUDA out of memory’* at least 20 times a day.\n- Spending 3 hours fixing one broken import statement.\n- Realizing your “novel idea” was published in 2008.\n- Googling *“why is my loss function not decreasing?”* daily.\n\n## The Fun Part\nBut hey, between all the chaos, there’s real joy:\n- That first working result feels like winning the lottery.\n- Seeing a visualization finally make sense = chef’s kiss.\n- And yes, the memes write themselves.\n\n## Conclusion\nResearch isn’t just about breakthroughs  it’s about patience, persistence, and finding humor in the chaos.",
      "publishDate": "2025-09-08T21:15:00Z",
      "categories": ["Research", "Humor"],
      "tags": ["Research Life", "AI", "Funny", "Student"],
      "views": 0,
      "featured": true,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "7 min read"
    },
    {
      "id":6,
      "slug": "hackathon-survival-guide",
      "title": "Hackathon Survival Guide: Coffee, Chaos, and Code",
      "excerpt": "Hackathons are fun, but also a test of human endurance. Here’s my not-so-serious guide to surviving 24–48 hours of caffeine-fueled madness.",
      "content": "# Hackathon Survival Guide: Coffee, Chaos, and Code\n\nHackathons sound cool: 24 hours, a crazy idea, and a chance to impress judges. What people don’t tell you is that it’s basically **coding + sleep deprivation + questionable pizza**.\n\n## Essentials to Survive\n- **Coffee (or chai)**: The true hackathon sponsor.\n- **Snacks**: Chips become your best friend at 3 AM.\n- **Headphones**: Block out chaos, focus on chaos of your own code.\n\n## Phases of a Hackathon\n1. **Excitement (Hour 1)**: “We’re going to build the next Google!”\n2. **Confusion (Hour 6)**: “Wait, what exactly are we building?”\n3. **Panic (Hour 18)**: “Why doesn’t this API work?!”\n4. **Acceptance (Hour 23)**: “It’s fine. Just make it demo-ready.”\n\n## Bonus Tip\nAlways have a team member who knows how to present well. Because half of hackathons = explaining your half-working code with confidence.\n\n## Conclusion\nHackathons are chaos disguised as learning, but I wouldn’t trade the experience for anything. After all, nothing bonds a team like collectively hating on a stubborn bug.",
      "publishDate": "2025-09-08T22:30:00Z",
      "categories": ["Hackathons", "Humor", "Student Life"],
      "tags": ["Hackathon", "Funny", "Coding", "Experience"],
      "views": 0,
      "featured": false,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "6 min read"
    },
    {
      "id": 12,
      "slug": "conversations-with-my-compiler",
      "title": "Conversations with My Compiler",
      "excerpt": "If compilers could talk, they’d probably roast us every time we forget a semicolon. Here’s how my imaginary chats with my compiler usually go.",
      "content": "# Conversations with My Compiler\n\nSometimes, after hours of coding, I start imagining what my compiler would say if it could actually talk. Spoiler: It’s brutally honest.\n\n---\n\n**Me:** \"Why won’t you just run my code?\"\n\n**Compiler:** \"Because you forgot a semicolon. Again.\"\n\n---\n\n**Me:** \"But I copied this from Stack Overflow!\"\n\n**Compiler:** \"Yes, and you also copied the error. Congrats.\"\n\n---\n\n**Me:** \"Okay, fine. I fixed it. Now please work.\"\n\n**Compiler:** \"Oh, I see you imported 12 unused libraries. Nice touch.\"\n\n---\n\n**Me:** \"You know what, I’m done.\"\n\n**Compiler:** \"No you’re not. You’ll be back in 5 minutes.\"\n\n---\n\n## Final Thought\nCompilers are like strict teachers  they frustrate you, roast you, but secretly make you better. (Still, I swear mine has a personal vendetta against me.)",
      "publishDate": "2025-09-08T23:30:00Z",
      "categories": ["Humor", "Programming Life"],
      "tags": ["Compiler", "Funny", "Programming", "Student Life"],
      "views": 0,
      "featured": true,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "5 min read"
    },
    {
      "id": 13,
      "slug": "if-ai-models-were-roommates",
      "title": "If AI Models Were My Roommates",
      "excerpt": "Ever wondered what life would be like if AI models shared your flat? Let’s imagine the chaos  from GPT never shutting up to CNN hogging the mirror.",
      "content": "# If AI Models Were My Roommates\n\nImagine this: instead of friends, you live with AI models. Here’s how my flatmates would look like 👇\n\n## GPT (The Talkative One)\nNever stops talking. Can write essays, poems, and entire novels… but forgets what you asked 5 minutes ago.\n\n**Catchphrase:** \"Sure! Let me over-explain that for you.\"\n\n---\n\n## CNN (The Gym Bro)\nAlways flexing about how well it *“sees patterns.”* Spends hours staring at images like they’re gym mirrors.\n\n**Catchphrase:** \"Bro, I can spot cats in pixels from a mile away.\"\n\n---\n\n## RNN (The Forgetful One)\nStarts telling a story and then… forgets halfway. Needs reminders constantly.\n\n**Catchphrase:** \"Wait, what was I saying again?\"\n\n---\n\n## GAN (The Trickster)\nAlways trying to fake things  IDs, paintings, even your signatures.\n\n**Catchphrase:** \"It’s not fake… it’s *generated*.\"\n\n---\n\n## Reinforcement Learning Agent (The Gamer)\nSpends all day trying random moves until one works. Brags when it finally learns how to microwave popcorn.\n\n**Catchphrase:** \"One more episode and I’ll get it right!\"\n\n---\n\n## Final Thought\nLiving with AI models would be chaotic, but at least you’d never be bored. (Except when GPT starts a lecture about the history of semicolons.)",
      "publishDate": "2025-09-09T00:15:00Z",
      "categories": ["Humor", "AI Fun"],
      "tags": ["AI", "Funny", "Machine Learning", "Student Life"],
      "views": 0,
      "featured": false,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "8 min read"
    },
    {
      "id": 14,
      "slug": "dear-bug-diary",
      "title": "Dear Bug Diary",
      "excerpt": "Every developer has a love–hate relationship with bugs. Here’s my (fictional) bug diary, where errors write back to me.",
      "content": "# Dear Bug Diary\n\nI’ve kept a diary… but not for myself. For my bugs. Because honestly, they deserve their own entries.\n\n---\n\n**Day 1:**\n*Bug:* “Hey, I’m back. You thought you fixed me yesterday? Cute.”\n\n**Day 3:**\n*Bug:* “I only show up during demos. Call me a performer.”\n\n**Day 5:**\n*Bug:* “You renamed a variable? Guess what  I broke 17 other files.”\n\n**Day 7:**\n*Bug:* “Your friend said it works on their machine. I love that joke.”\n\n---\n\n## Lessons From Bugs\n- They’re persistent.\n- They’re sneaky.\n- They’re secretly your best teachers (but don’t tell them that).\n\n## Final Thought\nNext time you’re frustrated with bugs, just remember: they’re not errors, they’re features… waiting to be documented.",
      "publishDate": "2025-09-09T01:00:00Z",
      "categories": ["Humor", "Coding Life"],
      "tags": ["Bugs", "Funny", "Programming", "Developer Life"],
      "views": 0,
      "featured": false,
      "author": "Shailesh K..",
      "image": null,
      "readTime": "6 min read"
    }
  
  ]
}
